-- ── Category ────────────────────────────────────────────────
INSERT INTO categories (id, name)
VALUES (1, '한식'),
       (2, '중식'),
       (3, '일식'),
       (4, '양식'),
       (5, '동남아식'),
       (6, '채식'),
       (7, '분식'),
       (8, '베이커리');

-- ── Taste ───────────────────────────────────────────────────
INSERT INTO tastes (id, name)
VALUES (1, '매운맛'),
       (2, '단맛'),
       (3, '짠맛'),
       (4, '신맛'),
       (5, '고소한맛'),
       (6, '담백한맛'),
       (7, '쓴맛');

-- ── Allergy ─────────────────────────────────────────────────
-- 식품의약품안전처 고시 알레르기 유발 식품 22종 기준
INSERT INTO allergies (id, name)
VALUES (1, '난류 (달걀)'),
       (2, '우유'),
       (3, '메밀'),
       (4, '땅콩'),
       (5, '대두 (콩)'),
       (6, '밀'),
       (7, '고등어'),
       (8, '게'),
       (9, '새우'),
       (10, '돼지고기'),
       (11, '복숭아'),
       (12, '토마토'),
       (13, '아황산류'),
       (14, '호두'),
       (15, '닭고기'),
       (16, '쇠고기'),
       (17, '오징어'),
       (18, '조개류 (굴, 전복, 홍합)'),
       (19, '잣'),
       (20, '아몬드'),
       (21, '캐슈넛'),
       (22, '참깨');
